{
  "culture": "en",
  "texts": {
    "Icp": "粤ICP备2022031812号",
    "Menu:Home": "Home",
    "Menu:About": "About",
    "Welcome": "Welcome",
    "LongWelcomeMessage": "Welcome to the application. This is a startup project based on the ABP framework. For more information, visit abp.io.",
    "QuickTemplate": "Quick Template",
    "AppName": "Quick Template",
    "AboutMe": "Senior web technology expert, with more than 20 years of work experience, has been committed to the research of web development frameworks.",
    "Blog": "Blog",
    "CompanyShortName": "QuickTemplate",
    "WebDescription": "This website is a demo site that showcases the relevant technologies of Ext Js combined with Abp.io.",
    "DemoCard:Localization": "Localization in Json format",
    "DemoCard:Ajax": "Improved Ext.ajax",
    "DemoCard:Datetime": "Datetime field",
    "DemoCard:OAuth2": "OAuth2 authentication and login",
    "DemoCard:Enumeration": "Use of enumerations",
    "DemoCard:Router": "The use of routes",
    "DemoCard:Crud": "Crud integration",
    "DemoCard:SignalR": "SignalR integration",
    "DemoCard:Localization:Description": "Localized files are provided through the server to enable the application to dynamically switch language text.",
    "DemoCard:Ajax:Description": "Encapsulation of Ext.Ajax makes it easier to use Ajax.",
    "DemoCard:Datetime:Description": "Add time display and selection",
    "DemoCard:OAuth2:Description": "Authenticate and log in through OAuth2 to enable third-party login",
    "DemoCard:Enumeration:Description": "Use the enumeration class and return the application in JSON format to use the enumeration in your application.",
    "DemoCard:Router:Description": "Routing features for full view through routing settings",
    "DemoCard:Crud:Description": "Package the Crud controller for rapid development",
    "DemoCard:SignalR:Description": "Integrates Microsoft SignalR functionality to enable real-time server-client communication.",
    "MainMenu.Dashboard": "Dashboard",
    "MainMenu.System": "System Management",
    "SubMenu.User": "Users",
    "SubMenu.Role": "Roles",
    "SubMenu.District": "District",
    "SubMenu.Infrastructure": "Infrastructures",
    "SubMenu.SystemSetting": "System Setting",
    "DisplayName:Name": "Name",
    "DisplayName:Surname": "Surname",
    "DisplayName:Password": "Password",
    "DisplayName:Email": "Email address",
    "DisplayName:PhoneNumber": "Phone number",
    "DesktopClient": "Desktop client",
    "MobileClient": "Mobile client",
    "OpenSourceLicenseWith": "Open source license with",
    "AboutUs": "About Us",
    "TagHelpers": "Tag Helpers",
    "Portfolios": "Portfolios",
    "SourceCode": "SOURCE CODE",
    "GetStarted": "GET STARTED",
    "Abp": "ABP is a domain-driven design principle and pattern with built-in infrastructure such as background services, event buses, seed data, distributed locks, audit logs, data filtering, mail sending, and clocking, making it ideal for creating modern web application frameworks for multi-tenancy and microservices architectures.",
    "QuickTemplateDescription": "Quick template provide an out-of-the-box development framework for rapid development of modern web applications by combining the respective advantages of ABP and Ext JS to provide the necessary encapsulation. Through this framework, you can learn both ABP and Ext JS.",
    "ExtJs": "Sencha Ext JS is arguably the most elegant Javascript framework out there, and those who like it will love it, and those who don't like it will avoid it. With 140+ pre-integrated and tested high-performance UI components built-in, it's ideal for building data-intensive, cross-platform web and mobile applications.",
    "MetroUI": "MetroUI is an open-source front-end toolkit similar to Bootstrap, inspired by Microsoft Fluent (formerly Metro) design principles. This website makes MetroUI into ABP's theme module, which can be used directly in ABP projects, which is more practical than ABP's original theme.",
    "W2UI": "W2UI is also an open source front-end toolkit, but the overall effect is not too good, its main feature is that as an open source framework, Grid is good, simple and convenient, better than ABP's original datatables. Some of the administrative functions of this website are implemented by W2UI's Grid. The toolkit has also been made into an ABP module.",
    "AboutQuickTemplate": "ABOUT QUCIK TEMPLATE",
    "Documents": "Documents"
  }
}
